[
    {
        "title": "A Data Management Model for Malaria Control: A Case of Rwanda",
        "pub_year": "2023",
        "citation": "2023 IEEE AFRICON, 1-6, 2023"
    },
    {
        "title": "A Dependable Digital System Model for Malaria Monitoring",
        "pub_year": "2022",
        "citation": "Preprints, 2022"
    },
    {
        "title": "A new time-dependent algorithm for post enrolment-based course timetabling problem",
        "pub_year": "2016",
        "citation": "2016 Eighth International Conference on Advanced Computational Intelligence …, 2016"
    },
    {
        "title": "Analyzing social influence in recommender systems",
        "pub_year": "2020",
        "citation": "Wien, 2020"
    },
    {
        "title": "Analyzing the impact of social connections on rating behavior in social recommender systems",
        "pub_year": "2017",
        "citation": "Proceedings of the 25th Conference on User Modeling, Adaptation and …, 2017"
    },
    {
        "title": "Discrete Cosine Coefficients as Images features for Fire Detection based on Computer Vision.",
        "pub_year": "2014",
        "citation": "J. Comput. 9 (2), 295-300, 2014"
    },
    {
        "title": "Dynamic reducts computation analysis based on rough sets",
        "pub_year": "2014",
        "citation": "2014 10th International Conference on Natural Computation (ICNC), 480-485, 2014"
    },
    {
        "title": "Fairness and diversity in social-based recommender systems",
        "pub_year": "2020",
        "citation": "Adjunct Publication of the 28th ACM Conference on User Modeling, Adaptation …, 2020"
    },
    {
        "title": "IT-Aided Forecasting Model for Malaria Spread for the Developing World",
        "pub_year": "2023",
        "citation": "2023 Conference on Information Communications Technology and Society (ICTAS …, 2023"
    },
    {
        "title": "Mining user behavior in social recommender systems",
        "pub_year": "2018",
        "citation": "Proceedings of the 8th International Conference on Web Intelligence, Mining …, 2018"
    },
    {
        "title": "The impact of social connections in personalization",
        "pub_year": "2019",
        "citation": "Adjunct Publication of the 27th Conference on User Modeling, Adaptation and …, 2019"
    },
    {
        "title": "The role of activity and similarity in rating and social behavior in social recommender systems",
        "pub_year": "2019",
        "citation": "International Journal on Artificial Intelligence Tools 28 (06), 1960004, 2019"
    }
]