[
    {
        "title": "A Cloud-Based Business Continuity Framework for Universities.",
        "pub_year": "2020",
        "citation": ""
    },
    {
        "title": "A Cloud-Based Business Continuity for Universities: Issues and Challenges (short paper).",
        "pub_year": "2020",
        "citation": "ACSE, 2020"
    },
    {
        "title": "A Hybrid Approach for Personalized Recommender System Using Weighted TFIDF on RSS Contents",
        "pub_year": "2016",
        "citation": "International Journal of Computer Applications Technology and Research 11, 2016"
    },
    {
        "title": "A Hybrid Approach for Personalized Recommender System Using Weighted Term Frequency Inverse Document Frequency",
        "pub_year": "2018",
        "citation": "JKUAT-COPAS, 2018"
    },
    {
        "title": "A K-Means Based Multi-level Text Clustering Algorithm for Retrieval of Research Information",
        "citation": ""
    },
    {
        "title": "A Review of Color Image Vectorization Techniques",
        "pub_year": "2017",
        "citation": "International Journal of Innovative Research and Development 6 (5), 2017"
    },
    {
        "title": "A Self Scheduling and Power Control MAC Protocol for Interference Mitigation in Wireless Body Area Networks",
        "pub_year": "2020",
        "citation": ""
    },
    {
        "title": "A Stacking Approach to Direct Marketing Response Modeling",
        "pub_year": "2018",
        "citation": "Asian Journal of Research in Computer Science 1 (2), 1-13, 2018"
    },
    {
        "title": "A Trust Model for Context-Aware E-Health Services",
        "pub_year": "2021",
        "citation": "IT Convergence and Security: Proceedings of ICITCS 2021, 177-189, 2021"
    },
    {
        "title": "A framework for Enhancing Privacy in Location Based Services",
        "pub_year": "2016",
        "citation": "Jomo Kenyatta University of Agriculture and Technology, 2016"
    },
    {
        "title": "A hybrid architecture to improve SOAP performance in web services communication",
        "pub_year": "2015",
        "citation": ""
    },
    {
        "title": "A hybrid framework for cloud computing adoption for small and medium size enterprises.",
        "pub_year": "2018",
        "citation": "Int J Sci Adv Inf Technol 7 (4), 2018"
    },
    {
        "title": "A hybrid knowledge-driven approach for composite activity modelling and recognition in smart environments",
        "pub_year": "2013",
        "citation": "University of Ulster, 2013"
    },
    {
        "title": "A hybrid ontological and temporal approach for composite activity modelling",
        "pub_year": "2012",
        "citation": "2012 IEEE 11th International Conference on Trust, Security and Privacy in …, 2012"
    },
    {
        "title": "A knowledge-driven approach to composite activity recognition in smart environments",
        "pub_year": "2012",
        "citation": "Ubiquitous Computing and Ambient Intelligence: 6th International Conference …, 2012"
    },
    {
        "title": "A model for predicting students’ academic performance using a hybrid of K-means and decision tree algorithms",
        "pub_year": "2015",
        "citation": "International Journal of Computer Applications Technology and Research 4 (9 …, 2015"
    },
    {
        "title": "A model for visual and intuitive crime investigation based on associative rule mining technique (VICIBARM): a case study of Kenya",
        "pub_year": "2019",
        "citation": "2019 IST-Africa Week Conference (IST-Africa), 1-8, 2019"
    },
    {
        "title": "A review of SOAP performance optimization techniques to improve communication in web services in loosely coupled systems",
        "pub_year": "2014",
        "citation": "International Journal of Computer Science Issues (IJCSI) 11 (2), 142, 2014"
    },
    {
        "title": "A social network-based framework for interactive and personalized web-based learning",
        "pub_year": "2018",
        "citation": "International Journal of Scientific and research Publications 8 (3), 237-247, 2018"
    },
    {
        "title": "A survey on privacy and security of Internet of Things",
        "pub_year": "2020",
        "citation": "Computer Science Review 38, 100312, 2020"
    },
    {
        "title": "A systematic approach to adaptive activity modeling and discovery in smart homes",
        "pub_year": "2011",
        "citation": "2011 4th International Conference on Biomedical Engineering and Informatics …, 2011"
    },
    {
        "title": "AGEEPS: an agent-based electronic purchasing system",
        "pub_year": "2007",
        "citation": ""
    },
    {
        "title": "Adaptive Cluster Head Selection Scheme for High Mobility Based IEEE 802.15. 6 Wireless Body Area Networks",
        "pub_year": "2018",
        "citation": "Journal of Sensor Technology, 2018"
    },
    {
        "title": "Ambient Assisted Living. ICT-based Solutions in Real Life Situations: 7th International Work-Conference, IWAAL 2015, Puerto Varas, Chile, December 1-4, 2015, Proceedings",
        "pub_year": "2015",
        "citation": "Springer, 2015"
    },
    {
        "title": "An Algorithm for the Spatiotemporal Dynamic of Insect Pest in Complex Agricultural System",
        "citation": ""
    },
    {
        "title": "An Image Denoising Technique Using Wavelet-Anisotropic Gaussian Filter-Based Denoising Convolutional Neural Network for CT Images",
        "pub_year": "2023",
        "citation": "Applied Sciences 13 (21), 12069, 2023"
    },
    {
        "title": "An agent-mediated ontology-based approach for composite activity recognition in smart homes",
        "pub_year": "2013",
        "citation": "JOURNAL OF UNIVERSAL COMPUTER SCIENCE, 2013"
    },
    {
        "title": "An aggregated technique for optimization of SOAP performance in communication in Web services",
        "pub_year": "2015",
        "citation": "Service Oriented Computing and Applications, 1-6, 2015"
    },
    {
        "title": "An ontology-based hybrid approach to activity modeling for smart homes",
        "pub_year": "2013",
        "citation": "IEEE Transactions on human-machine systems 44 (1), 92-105, 2013"
    },
    {
        "title": "Combining ontological and temporal formalisms for composite activity modelling and recognition in smart homes",
        "pub_year": "2014",
        "citation": "Future Generation Computer Systems 39, 29-43, 2014"
    },
    {
        "title": "Cover feature: guest editors’ introduction title: internet of things for everyday living: ubiquitous intelligence at Scale",
        "pub_year": "2023",
        "citation": "Journal of Ambient Intelligence and Humanized Computing, 1-4, 2023"
    },
    {
        "title": "Critical Success Factors Influencing Adoption and Use of E-government Services by SMEs in the Manufacturing Sector in Kenya",
        "pub_year": "2017",
        "citation": "International Advanced Research Journal in Science, Engineering and …, 2017"
    },
    {
        "title": "Data mining model for predicting student enrolment in stem courses in higher education institutions",
        "pub_year": "2016",
        "citation": ""
    },
    {
        "title": "Detecting Phishing Attacks Using Feature Importance-Based Machine Learning Approach",
        "pub_year": "2023",
        "citation": "2023 IEEE AFRICON, 2023"
    },
    {
        "title": "Dynamic sensor data segmentation for real-time knowledge-driven activity recognition",
        "pub_year": "2014",
        "citation": "Pervasive and Mobile Computing 10, 155-172, 2014"
    },
    {
        "title": "Estimating Crime Rates Using Jumping Finite Automata on Tweets.",
        "pub_year": "2023",
        "citation": "IAENG International Journal of Computer Science 50 (4), 2023"
    },
    {
        "title": "Feature selection for classification using principal component analysis and information gain",
        "pub_year": "2021",
        "citation": "Expert Systems with Applications 174, 114765, 2021"
    },
    {
        "title": "Framework for improving usability of learning management systems by integrating pedagogical agent",
        "pub_year": "2017",
        "citation": "International Journal of Computer Applications 166 (8), 7-16, 2017"
    },
    {
        "title": "High performance plagiarism detection using Rabin’s fingerprint and adaptive N-gram methodologies",
        "pub_year": "2016",
        "citation": "Int. J. Sci. Eng. Res 7 (12), 1464-1473, 2016"
    },
    {
        "title": "Hybrid IEEE 802.15. 6 wireless body area networks interference mitigation model for high mobility interference scenarios",
        "pub_year": "2018",
        "citation": "Wireless Engineering and Technology, 2018"
    },
    {
        "title": "IEEE UIC 2018 Organizing and Program Committees",
        "citation": ""
    },
    {
        "title": "Image representation using RGB color space",
        "pub_year": "2014",
        "citation": "Int. J. Innov. Res. Dev 3 (8), 2014"
    },
    {
        "title": "Impact Analysis of Solutions for Chronic Disease Prevention and Management: 10th International Conference on Smart Homes and Health Telematics, ICOST 2012, Artimino, Tuscany …",
        "pub_year": "2012",
        "citation": "Springer, 2012"
    },
    {
        "title": "Information Security Management Framework for E-Government in the Kenyan Public Sector: A Case of the Ministry of Public Service, Youth and Gender Affairs",
        "pub_year": "2017",
        "citation": "International Journal 6 (3), 2017"
    },
    {
        "title": "Infrastructure as Code for Business Continuity in Institutions of Higher Learning",
        "pub_year": "2021",
        "citation": "2021 International Conference on Electrical, Computer and Energy …, 2021"
    },
    {
        "title": "Intelligent Agents’ Based Fuzzy Liquidity Management Technique for Mobile Money Transfer",
        "citation": ""
    },
    {
        "title": "Jumping finite automata for tweet comprehension",
        "pub_year": "2019",
        "citation": "2019 International Multidisciplinary Information Technology and Engineering …, 2019"
    },
    {
        "title": "Lexicon‐pointed hybrid N‐gram Features Extraction Model (LeNFEM) for sentence level sentiment analysis",
        "pub_year": "2021",
        "citation": "Engineering Reports 3 (8), e12374, 2021"
    },
    {
        "title": "Matrix factorization techniques for context-aware collaborative filtering recommender systems: A survey",
        "pub_year": "2018",
        "citation": "Canadian Center of Science and Education, 2018"
    },
    {
        "title": "Modeling on body delay tolerant network sink locality of wireless body area networks for different body postures",
        "pub_year": "2020",
        "citation": ""
    },
    {
        "title": "Modeling the risk of invasion and spread of Tuta absoluta in Africa",
        "pub_year": "2016",
        "citation": "Ecological Complexity 28, 77-93, 2016"
    },
    {
        "title": "Multi-Agent Systems and Distributed Constraint Satisfaction for Decision Support in Marine Ecosystem Management",
        "pub_year": "2016",
        "citation": "J Comput Sci Syst Biol 9, 154-162, 2016"
    },
    {
        "title": "Ontology-Enabled Activity Learning and Model Evolution in Smart Homes",
        "pub_year": "2010",
        "citation": "Springer, Berlin, Heidelberg, 2010"
    },
    {
        "title": "Ontology-based learning framework for activity assistance in an adaptive smart home",
        "pub_year": "2011",
        "citation": "Activity recognition in pervasive intelligent environments, 237-263, 2011"
    },
    {
        "title": "Ontology-driven approach for knowledge sharing and retrieval",
        "pub_year": "2016",
        "citation": "International Journal of Computer Science Issues (IJCSI) 13 (4), 59, 2016"
    },
    {
        "title": "Ontology-enabled activity learning and model evolution in smart homes",
        "pub_year": "2010",
        "citation": "Ubiquitous Intelligence and Computing: 7th International Conference, UIC …, 2010"
    },
    {
        "title": "Pediatric Reference Values for Some Renal Biochemistry Tests in Meru County, Kenya",
        "pub_year": "2019",
        "citation": "International Journal of Bioprocess & Biotechnological Advancements, 2019"
    },
    {
        "title": "RFID-based location based services framework for alerting on black spots for accident prevention",
        "pub_year": "2021",
        "citation": "Egypt. Informatics J., no. xxxx, 2021"
    },
    {
        "title": "Scoped class cohesion metric for software process assessment",
        "pub_year": "2016",
        "citation": "International Journal of Computer Science Issues (IJCSI) 13 (2), 12, 2016"
    },
    {
        "title": "Sentiment analysis of text reviews using lexicon-enhanced bert embedding (LeBERT) model with convolutional neural network",
        "pub_year": "2023",
        "citation": "Applied Sciences 13 (3), 1445, 2023"
    },
    {
        "title": "Sentiment analysis on social media tweets using dimensionality reduction and natural language processing",
        "pub_year": "2023",
        "citation": "Engineering Reports 5 (3), e12579, 2023"
    },
    {
        "title": "Smart traffic light control using fuzzy logic and wireless sensor network",
        "pub_year": "2017",
        "citation": "2017 Computing Conference, 450-460, 2017"
    },
    {
        "title": "Stock price prediction using neural network models based on tweets sentiment scores",
        "pub_year": "2017",
        "citation": "Journal of Computer Sciences and Applications 5 (2), 64-75, 2017"
    },
    {
        "title": "Techniques for Smart Traffic Control: An In-depth Review",
        "pub_year": "2015",
        "citation": "International Journal of Computer Applications Technology and Research 4 (7 …, 2015"
    },
    {
        "title": "Telecommuting Model for Small and Medium Enterprises (SMEs) in Kenya",
        "pub_year": "2016",
        "citation": ""
    },
    {
        "title": "Telecommuting model for small and medium enterprises (SMES) in Kenya",
        "pub_year": "2016",
        "citation": "European Journal of Computer Science and Information Technology 4 (4), 13-19, 2016"
    },
    {
        "title": "The use of social networking sites for learning in institutions of higher learning",
        "pub_year": "2015",
        "citation": "International Journal of Scientific and Technology Research 4 (12), 51-56, 2015"
    },
    {
        "title": "Time Handling for Real-time Progressive Activity Recognition",
        "pub_year": "2011",
        "citation": "ACM, 2011"
    },
    {
        "title": "Time handling for real-time progressive activity recognition",
        "pub_year": "2011",
        "citation": "Proceedings of the 2011 International workshop on situation activity & goal …, 2011"
    },
    {
        "title": "Towards Sustainable Computing through Ambient Intelligence.",
        "pub_year": "2013",
        "citation": "J. Univers. Comput. Sci. 19 (17), 2486-2489, 2013"
    },
    {
        "title": "Ubiquitous Computing and Ambient Intelligence",
        "pub_year": "2017",
        "citation": "Springer,, 2017"
    },
    {
        "title": "Ubiquitous Computing and Ambient Intelligence: 6th International Conference, UCAmI 2012, Vitoria-Gasteiz, Spain, December 3-5, 2012, Proceedings",
        "pub_year": "2012",
        "citation": "Springer, 2012"
    },
    {
        "title": "Ubiquitous Computing and Ambient Intelligence: Context-awareness and Context-driven Interaction: 7th International Conference, UCAmI 2013, Carrillo, Costa Rica, December 2-6 …",
        "pub_year": "2013",
        "citation": "Springer, 2013"
    },
    {
        "title": "Ubiquitous Computing and Ambient Intelligence: Personalisation and User Adapted Services: 8th International Conference, UCAmI 2014, Belfast, UK, December 2-5, 2014, Proceedings",
        "pub_year": "2014",
        "citation": "Springer, 2014"
    },
    {
        "title": "Ubiquitous Intelligence and Computing",
        "pub_year": "2010",
        "citation": "Springer Berlin Heidelberg, 2010"
    },
    {
        "title": "Ubiquitous Intelligence and Computing: 7th International Conference, UIC 2010, Xi'an, China, October 26-29, 2010, Proceedings",
        "pub_year": "2010",
        "citation": "Springer, 2010"
    },
    {
        "title": "Ubiquitous computing and ambient intelligence",
        "pub_year": "2017",
        "citation": "Proc. 6th Int. Conf.(UCAmI), 1348-1353, 2017"
    },
    {
        "title": "Using Naïve Bayes algorithm in detection of hate tweets",
        "pub_year": "2018",
        "citation": "International Journal of Scientific and Research Publications 8 (3), 99-107, 2018"
    },
    {
        "title": "Using apriori algorithm technique to analyze crime patterns for kenyan national crime data: A county perspective",
        "pub_year": "2020",
        "citation": "2020 IST-Africa Conference (IST-Africa), 1-8, 2020"
    },
    {
        "title": "Workshop overview for the international workshop on situation, activity and goal awareness",
        "pub_year": "2011",
        "citation": "Proceedings of the 13th international conference on Ubiquitous computing …, 2011"
    }
]